import React from 'react';
import css from './Oferta.module.css';
import SharedLayout from '../../components/SharedLayout/SharedLayout';
import Button from '../../UI/Button/Button';
import { useNavigate } from 'react-router-dom';

const ofertaText = `Управління сайтом (далі - «Сайт») здійснюється ФОП Бондаренко Євгенія Євгеніївна, РНОКПП: 3350608102, яка зареєстрована і діє відповідно до вимог законодавства України (далі - «Виконавець»).

Даний Договір публічної оферти (далі - «Оферта», «Договір») являє собою офіційну відкриту пропозицію Виконавця укласти Договір про надання Освітніх послуг шляхом акцепту даної Оферти на Сайті.

ВИЗНАЧЕННЯ ТЕРМІНІВ

Даним пунктом визначається інтерпретація наведених нижче термінів та дефініцій, що використовуються у цьому Договорі.
«Сайт» - веб-сторінка Курсу, розташована за посиланням домену: slimform.org і керована Виконавцем, включаючи сукупність всієї розміщеної на Сайті інформації, та матеріалів, а також інформаційних і технічних засобів Сайту. Термін «Сайт» охоплює посилання на інші відкриті чи закриті веб-ресурси, на яких розміщуються матеріали Курсу.
«Курс» - сукупність текстових, аудіо, відео та аудіовізуальних матеріалів, практичних завдань тощо, об'єднаних загальною темою та структурованих Виконавцем з метою надання Освітніх послуг.
«Договір», «Оферта» - документ, опублікований на Сайті в мережі Інтернет, який регулює відносини між Користувачами, Замовниками і Виконавцем в процесі надання Освітніх послуг.
«Виконавець» - уповноважена особа, яка здійснює контроль над даним Сайтом і пропонує необмеженому числу осіб (Користувачам) надання Освітніх послуг.
«Користувач» - будь-яка фізична особа, яка має доступ до Сайту, яка використовує Сайт з допомогою мережі Інтернет.
«Замовник» - Користувач, який здійснив акцепт цієї Оферти і є одержувачем (споживачем) Освітніх послуг за цим Договором.
«Освітні послуги», «Послуги» - надання Виконавцем доступу Замовникам до комплексу Курсів (в т.ч. відеозаписів лекцій, аудіозаписів, текстовому супроводу курсів), розроблених Виконавцем.
«Програмне забезпечення», «ПО» - Інтернет-браузер (Internet Explorer, FireFox, Google Chrome тощо) для доступу до інформаційних ресурсів, що знаходяться в мережі Інтернет, інші програми для передачі, зберігання, обробки інформації, що надається.
«Сookies» - невеликий фрагмент даних, відправлений веб-сервером і такий, що зберігається на комп'ютері користувача, веб-клієнт або веб-браузер кожен раз пересилає веб-серверу в HTTP-запиті при спробі відкрити сторінку відповідного сайту.
«IP-адреса» - унікальна мережева адреса вузла в комп'ютерній мережі, побудована за протоколом IP, що дозволяє ідентифікувати місце розташування та інші відомості про Користувача.
«Фінансовий агент» - компанія, що надає сервіс Інтернет-платежів, який може бути інтегрованим в функціонал Сайту для оплати Замовником послуг, що надаються Виконавцем.
«Telegram» - система миттєвого обміну повідомленнями, що дозволяє здійснювати обмін текстовими, графічними, аудіо та аудіовізуальними повідомленнями, а також файлами інших форматів, розробником якої є Telegram FZ-LLC.
«Telegram-чат Виконавця» - чат у системі «Telegram», що дозволяє здійснювати обмін текстових, графічних, аудіо та аудіовізуальних повідомлень, а також файлів інших форматів, у рамках наданих послуг Виконавцем за цим Договором.
Терміни та дефініції, не визначені цим розділом, тлумачаться у значенні, визначеному чинним законодавством України, а за відсутності такого визначення - у їх звичайному розумінні.

УМОВИ ПРИЙНЯТТЯ ОФЕРТИ

Даний Договір є публічним, відповідно до ст. ст. 633, 641 Цивільного кодексу України (далі - «ЦК України»), беззастережне прийняття умов якого вважаються акцептуванням цієї оферти Замовником, для чого Виконавець публікує цей Договір.
Особа (Користувач), яка здійснила акцепт оферти, набуває всіх прав і обов'язків Замовника у порядку ст. 638 ЦК України. Акцептом цієї Оферти є здійснення Замовником повної оплати послуг Виконавця, відповідно до умов цього Договору. З моменту надходження грошових коштів на рахунок Виконавця, цей Договір вважається укладеним між Замовником та Виконавцем.
Ухвалення цієї Оферти означає, що Замовник повністю ознайомлений з умовами цього Договору та правилами платіжної системи - Фінансового агента, специфікою функціонування Сайту та/або іншого веб-сайту, систем та/або програмного забезпечення (ПО), в рамках яких розміщуються навчальні матеріали, визнає безумовну придатність Сайту для здійснення дій та досягнення цілей, що є предметом цього Договору. Окрім того, ухвалення цієї Оферти прирівнюється, відповідно до ч. 2 ст. 642 ЦК України, до укладення сторонами двостороннього письмового договору на умовах, які викладені у цій Оферті.

ПРЕДМЕТ ОФЕРТИ

Предметом цієї Оферти є платне надання Замовнику Освітніх послуг засобами Виконавця, відповідно до умов цієї Оферти, в очному (офлайн) або дистанційному (онлайн) форматі, відповідно до умов обраного Замовником Курсу, за винагороду, що виплачується Замовником на користь Виконавця.
Освітні послуги, що надає Виконавець, можуть містити в собі текстові, аудіо, відео та аудіовізуальні матеріали, практичні завдання, чат-підтримку та інші складові елементи Курсу.
Виконавець на свій розсуд визначає і розміщує на Сайті різні варіації комплексу Освітніх послуг (Курсів), які можуть відрізнятися за форматом, обсягом, наповненням, строками і вартістю. Актуальні і доступні для замовлення Курси, їх варіації, формати, вартість розміщені на Сайті.
Надання Послуг може здійснюватися одним або декількома способами, відповідно до умов обраного Замовником Курсу:
очно, у місці, визначеному Виконавцем та повідомленому Замовнику до початку надання Освітніх послуг;
дистанційно, у закритому розділі Сайту або іншого веб-сайту, шляхом надання доступу до систем та/або програмного забезпечення (ПО), на якому знаходяться матеріали, зокрема, за допомогою Telegram-чату Виконавця.
Усі деталі щодо способу надання Освітніх послуг повідомляються Замовнику за адресою електронної пошти або за контактними даними особистого облікового запису у Telegram, що були надані останнім під час заповнення онлайн-форми на Сайті.

СТРОК І ПОРЯДОК НАДАННЯ ПОСЛУГ

Строк та деталі надання Послуг за цим Договором обумовлюються специфікою і особливістю обраного та оплаченого Замовником Курсу. Такі відомості можуть розміщуватись Виконавцем на Сайті в інформаційному блоці доступних для замовлення Курсів.
Надання Послуг за цим Договором починається з моменту початку відповідного Курсу, за умови здійснення Замовником повної оплати Послуг.
Графік проходження уроків та/або етапів, що передбачаються Курсом, встановлюється Виконавцем самостійно на свій розсуд. Для максимального досягнення ефективності впровадження курсу Виконавець не рекомендує відступати від встановленого Курсом графіка занять.
Акцептування Замовником цієї Оферти, у порядку, передбаченому п. 2.2. цієї Оферти, прирівнюється до підписання Замовником Акту приймання-передачі наданих Послуг, що є підтвердженням повного та належного надання Послуг Виконавцем.

ПРАВА ТА ОБОВ'ЯЗКИ СТОРІН

Виконавець зобов'язується:
надати Замовнику оплачені останнім Послуги, відповідно до цього Договору та умов обраного Курсу;
у порядку виконання Договору і в рамках строку надання Послуг, забезпечити Замовнику персональний доступ до матеріалів Курсу, а також іншої супутньої і необхідної інформації у закритому розділі сайту або іншого веб-сайту, систем та/або програмного забезпечення (ПО), на якому знаходяться матеріали. Доступ до матеріалів Курсу забезпечується Виконавцем після повної оплати Послуг у порядку, визначеному цим Договором;
надати Освітні послуги, що передбачені обраним і сплаченим Замовником Курсом;
здійснювати перевірку виконаних Замовником практичних завдань, зворотній зв'язок з Замовником, якщо такі положення передбачені обраним і сплаченим Замовником Курсом;
зберігати в таємниці будь-яку особисту і/або конфіденційну інформацію, отриману від Замовника при наданні Послуг за цим Договором, відповідно до Політики конфіденційності і захисту персональних даних, розміщеної на Сайті;
дотримуватися вимог законодавства України, у т.ч., що стосуються обробки, передачі і захисту персональних даних Користувачів і Замовників;
у разі неможливості надання Послуг, проінформувати про це Замовника протягом 14 (чотирнадцяти) календарних днів з моменту здійснення останнім оплати та повернути у той самий строк внесені Замовником кошти.

Виконавець має право:
змінювати в односторонньому порядку наповнення закритого розділу Сайту або іншого веб-сайту, систем та/або програмного забезпечення (ПО), на якому знаходяться матеріали, форму проведення зворотного зв'язку, не змінюючи при цьому встановлену періодичність їх проведення і обсяг Послуг, а також змінювати і доповнювати зміст Курсу для Замовника;
у процесі надання Послуг Замовнику, давати спеціалізовані рекомендації щодо виконання завдань, передбачених Курсом, програмою, а також щодо додаткових дій, які дозволяють збільшити ефективність та досягаються шляхом впровадження результатів Курсів;
в односторонньому порядку змінювати і доповнювати умови цього Договору без попереднього узгодження з Замовником або будь-якого іншого повідомлення;
залучати третіх осіб для виконання своїх зобов'язань за Договором;
в односторонньому порядку розірвати цей Договір у випадках і порядку, передбачених цим Договором.

Замовник зобов'язується:
оплачувати Послуги на умовах та у порядку, передбаченому цим Договором;
прийняти Послуги Виконавця, відповідно до положень цього Договору;
проявляти повагу до Виконавця, інших Користувачів і Замовників;
при оформленні замовлення на надання Послуг, надати Виконавцю актуальну і достовірну інформацію, необхідну для здійснення зв'язку з Замовником в рамках надання Послуг за цим Договором, а саме: прізвище та ім'я, адресу електронної пошти, контактний номер телефону, ідентифікатори облікових записів Замовника у системі Telegram;
не передавати будь-яким способом третім особам доступ до матеріалів Курсу Виконавця, забезпечувати повну конфіденційність таких матеріалів та наданих Замовнику паролів доступу до таких матеріалів;
не копіювати і не поширювати будь-яким способом (не публікувати, не розміщувати на інших ресурсах в мережі Інтернет, не передавати або не перепродавати третім особам) матеріали, що належать Виконавцю та отримані в ході надання Послуг, не створювати на їх основі інформаційні продукти з метою вилучення комерційного прибутку, а також не використовувати цю інформацію будь-яким іншим чином, крім як для особистого використання. При порушенні цього положення, Замовник несе відповідальність відповідно до цього Договору та чинного законодавства України;
виконувати практичні завдання, передбачені відповідним Курсом.

Замовник має право:
вимагати від Виконавця надання інформації з питань, що стосуються організації і забезпечення належного надання Послуг, передбачених цим Договором.

ВАРТІСТЬ ПОСЛУГ І ПОРЯДОК РОЗРАХУНКІВ

Вартість Послуг, що надаються Виконавцем, і доступних до замовлення, вказується на Сайті або повідомляється Користувачу/Замовнику в особисті повідомлення у Telegram, або на електронну пошту, і може бути змінена Виконавцем на свій розсуд в будь-який час в односторонньому порядку. Змінена вартість діє з моменту опублікування чи відправки повідомлення Користувачу/Замовнику і поширюється тільки на ті послуги, що замовляються після опублікування нової вартості.
Оплата Послуг здійснюється Замовником:
у розмірі 100 % (ста відсотків) вартості Послуг до початку надання Освітніх послуг; або
у разі надання Освітніх послуг в очному (офлайн) форматі:
- шляхом оплати завдатку у розмірі, не менш як 50 % (п'ятдесяти відсотків) вартості Послуг до початку надання Освітніх послуг; та
- сплати залишку вартості Послуг безпосередньо перед початком надання Освітніх послуг.
Моментом оплати вважається надходження грошових коштів у розмірі 100 % (ста відсотків) вартості Послуг на розрахунковий рахунок Виконавця.
Оплата Освітніх послуг здійснюється:
за допомогою системи електронних платежів Фінансового агента, що передбачена функціоналом Сайту; або
на розрахунковий рахунок Виконавця, відповідно до реквізитів, повідомлених Замовнику.
До процедури оплати за допомогою системи електронних платежів Фінансового агента, застосовуються правила, визначені таким Фінансовим агентом.

УМОВИ І ПОРЯДОК ПОВЕРНЕННЯ КОШТІВ

Повернення грошових коштів Виконавцем здійснюється за заявою Замовника з копією квитанції про сплату вартості Послуг, передбачених цією Офертою, направленою на адресу електронної пошти Виконавця, зазначену в цьому Договорі, не пізніше початку надання Освітніх Послуг, за винятком випадків неможливості надання Послуг з вини Замовника. Заява Замовника, передбачена цим пунктом, має містити наступні відомості: прізвище ім'я та по-батькові Замовника, серію та/або номер паспорту та реєстраційний номер облікової картки платника податків Замовника, його контактні дані (номер телефону та адреса електронної пошти) та зазначення підстави з відповідним обгрунтуванням можливості повернення коштів, відповідно до цієї Оферти. У разі невідповідності заяви Замовника вимогам, передбаченими цим пунктом, Виконавець має право відмовити Замовнику у розгляді такої заяви.
Повернення грошових коштів здійснюється за вирахуванням фактичних витрат Виконавця на момент повернення. До таких фактичних витрат Виконавця відносяться (але не обмежуються), зокрема: комісія системи електронних платежів Фінансового агента за здійснення повернення коштів тощо.
Рішення про повернення або про відмову в поверненні коштів приймається Виконавцем протягом 5 (п'яти) робочих днів з моменту отримання ним відповідної заяви Замовника.
Грошові кошти повертаються на рахунок Замовника, з якого здійснювалась оплата Послуг, або інший рахунок, вказаний Замовником, протягом 14 (чотирнадцяти) робочих днів після прийняття рішення про повернення, враховуючи правила Фінансового агента, у випадку необхідності.
Заяви про повернення грошових коштів, спрямованих Виконавцю в процесі або після завершення надання Освітніх Послуг, не розглядаються.

ФОРС-МАЖОРНІ ОБСТАВИНИ

Сторони звільняються від відповідальності за часткове чи повне невиконання або неналежне виконання зобов'язань за Договором, якщо вони є наслідком непереборної сили (пожежі, повені, землетрусу, стихійного лиха, військових дій і інших обставин непереборної сили) (далі - «Форс-мажор»), і якщо ці обставини безпосередньо вплинули на виконання Договору, то виконання продовжується на строк, протягом якого діяли ці обставини.
Якщо форс-мажорні обставини будуть продовжуватися більше одного місяця, то кожна зі Сторін буде мати право відмовитися від подальшого виконання зобов'язань за Договором, і в цьому випадку Договір вважається припиненим у випадку досягнення Сторонами згоди про правові наслідки, згідно умов даного Договору.
Сторона, яка не може виконати зобов'язання за Договором, повинна письмово, не пізніше 5 (п'яти) робочих днів, повідомити іншу Сторону про настання форс-мажору. Наявність форс-мажорних обставин має бути підтверджена необхідними документами Торгово - промислової палати України або іншого уповноваженого органу України.
Неповідомлення або несвоєчасне повідомлення про настання чи припинення форс-мажорних обставин позбавляє Сторону права посилатися на такі обставини, як на підставу звільнення від відповідальності за порушення зобов'язань за цим Договором.

КОНФІДЕНЦІЙНІСТЬ

Уся інформація, що стосується укладення і виконання цього Договору, є конфіденційною, за винятком тієї інформації, яку Сторони офіційно оприлюднюють згідно з законодавством України.
Протягом строку дії Договору, а також після його припинення Замовник або Користувач не повинні надавати третім особам або розголошувати іншим способом конфіденційну інформацію, отриману в результаті виконання цього Договору.
За розголошення конфіденційної інформації Замовник або Користувач несе відповідальність згідно з законодавством України, а також зобов'язується відшкодувати завдані цим збитки.
Виконавець має право стягнути із Замовника або Користувача штраф у розмірі 100 000 (сто тисяч) гривень 00 коп. за кожний виявлений випадок:
порушення прав інтелектуальної власності або суміжних прав Виконавця, а саме: неправомірне та/або незаконне розміщення/поширення/продаж/обмін матеріалів Курсу, в тому числі частини або складових матеріалів або інших об'єктів інтелектуальної власності, які були отримані Замовником або Користувачем під час проходження Курсу;
створення подібних/схожих курсів, матеріалів, в тому числі частин або складових матеріалів або інших об'єктів інтелектуальної власності, які були отримані Замовником або Користувачем під час проходження Курсу.

ВИРІШЕННЯ СПОРІВ

Всі розбіжності та спори, пов'язані з виконанням умов даного Договору, вирішуються сторонами шляхом переговорів.
У разі, якщо Сторони в результаті переговорів не змогли дійти взаємної згоди, а також у разі, якщо одна з Сторін ухиляється від проведення переговорів, спір передається на розгляд суду в порядку, встановленому законодавством України.

СТРОК ДІЇ ДОГОВОРУ ТА ПОРЯДОК РОЗІРВАННЯ

Договір вступає в силу з моменту вчинення Замовником дій, передбачених п. 2.2. Договору, та діє до завершення строку надання Виконавцем Послуг за відповідним варіантом Курсу, обраним Замовником.
Договір може бути розірваний до моменту закінчення його дії за згодою Сторін, в випадках, передбачених цим Договором, та інших випадках, передбачених законодавством України.
Договір може бути розірваний між Сторонами у порядку, передбаченому законодавством України, а також:
в односторонньому порядку з ініціативи Виконавця у разі, якщо Замовником було допущено порушення умов даного Договору, прав інтелектуальної власності або суміжних прав Виконавця на розміщені ним курси та складові їх матеріали. При цьому, кошти, сплачені Замовником за цим Договором, поверненню не підлягають і є неустойкою (штрафом) за дії Замовника;
в односторонньому порядку з ініціативи Виконавця у разі, якщо Замовником було допущено порушення правил поведінки в процесі отримання Послуг за цим Договором, а саме: розпалювання міжнаціональних конфліктів, спам, розміщення реклами, нецензурні висловлювання, хамство, образи Виконавця, образу інших користувачів Сайту або іншого веб-сайту, систем та/або програмного забезпечення (ПО). При цьому, кошти, сплачені Замовником за цим Договором, поверненню не підлягають і є неустойкою (штрафом) за дії Замовника;
в односторонньому порядку з ініціативи Виконавця, у разі неможливості надання останнім Послуг за цим Договором. При цьому, Виконавець здійснює повернення сплачених Замовником коштів, за вирахуванням фактичних витрат, протягом 14 (чотирнадцяти) календарних днів, враховуючи правила Фінансового агента, у випадку необхідності;
в односторонньому порядку з ініціативи Виконавця, у разі, якщо Замовник не виконав передбачені Курсом практичні та/або підсумкові завдання (іспити) або у разі, якщо Замовник не склав передбачені цим підпунктом завдання (іспити).

ЗАКЛЮЧНІ ПОЛОЖЕННЯ

При виконанні даного Договору, Сторони керуються умовами Договору та законодавством України.
Даний Договір є договором публічної оферти та договором приєднання, відповідно до Цивільного кодексу України, опублікований на Сайті Виконавця в електронному вигляді.

РЕКВІЗИТИ ВИКОНАВЦЯ

Бондаренко Євгенія Євгеніївна
РНОКПП: 3350608102

АТ "УНІВЕРСАЛ БАНК"
UA633220010000026001330170240

Адреса: Полтава, Героїв АТО 71а, офіс 201

Контактні дані:
Тел.: +380669293948`;

const Oferta = () => {
  const navigate = useNavigate();
  return (
    <section className={css.section}>
      <SharedLayout>
        <Button
          text="Повернутися на головну"
          className={css.backButton}
          onClick={() => navigate('/')}
        />
        <article className={css.card}>
          <p className={css.label}>Юридична інформація</p>
          <h1 className={css.title}>
            ПУБЛІЧНИЙ ДОГОВІР
            <span>про надання інформаційних та освітніх послуг</span>
          </h1>

          <div className={css.content}>
            <p className={css.rawText}>{ofertaText}</p>
          </div>
        </article>
      </SharedLayout>
    </section>
  );
};

export default Oferta;
